CREATE TABLE news (
    id SERIAL PRIMARY KEY,
    title VARCHAR(255),
    content TEXT,
    author VARCHAR(100),
    description VARCHAR(255),
    created_at TIMESTAMP DEFAULT NOW(),
    image BYTEA
);

CREATE TABLE travels (
    t_id SERIAL PRIMARY KEY,
    altText VARCHAR(255),
    title VARCHAR(255),
    content text,
    price integer,
    duration text,
    totalPassengers integer,
    distance integer,
    t_type VARCHAR(255), 
    description text,
    destination text[],
    fromWhere text,
    startDate DATE,
    vehicle text[],
    included text[],
    notIncluded text[],
    t_plans JSONB[],
    created_at TIMESTAMP DEFAULT NOW(),
    image text,
    album text[],
    status VARCHAR(255)
);


CREATE TABLE blogs (
    id SERIAL PRIMARY KEY,
    altText VARCHAR(255),
    title VARCHAR(255),
    content text,
    author VARCHAR(100),
    publishDate DATE,
    category VARCHAR(255),
    image text,
);

CREATE TABLE reviews (
    id SERIAL PRIMARY KEY,
    author VARCHAR(50),
    review text,
    created_at DATE
);

CREATE TABLE bookings (
    id SERIAL PRIMARY KEY,
    lastName VARCHAR(100),
    firstName VARCHAR(100),
    phoneNumber VARCHAR(20),
    mail VARCHAR(100),
    t_type VARCHAR(255),
    t_id INTEGER,
    numberOfTravelers INTEGER,
    additionalInfo text,
    created_at DATE,
    status VARCHAR(50)
);

CREATE TABLE test (
    test_id SERIAL PRIMARY KEY,
    description VARCHAR(255)
)

SELECT *
	FROM public.travels;
	
INSERT INTO travels (t_id, altText, title, price, duration, totalPassengers, distance, t_type, description, destination, fromWhere, startDate, vehicle, included, notIncluded, plans, image, album, status)
VALUES (1, 'Япон улс, Токио хот', 'Япон', 2790000, '5 өдөр / 4 шөнө', 40, 3011, 'ordinary', 'Япон улсын Токио нийслэл хот нь Японы 47 мужийн нэг юм. Засаг захиргааны хуваарийн бус, уламжлалт Японы 8 бүс нутгийн нэг болох Канто бүсийн зүүн өмнөд талд байрладаг. Хот нь 23 дүүрэг болон баруун талын Тама бүсийн 30 дүүрэг, Изү болон Огасавара арлуудын 9 бага хот тосгодоос бүрддэг. 1923 оны 9-р сард 9 баллын хүчтэй газар хөдөлж хотын тэн хагас нь нуранга болж, 90 гаруй мянган хүн амиа алдсан. Энэ үйл явдлын дараагаар хотыг дахин барьж, сэргээсэн боловч дэлхийн хоёрдугаар дайны үеэр дахин томоохон хохирол амсаж бүхэлдээ сүйрч байжээ. Дайны дараах сэргээн босголтын ажил хурдацтайгаар явагдаж 1964 онд зуны олимпын наадмыг зарлажээ. Ингээд 20-р зууны дунд үед Япон улс эдийн засгийн хөгжлөөрөө тэргүүлж нийслэл Токио хот нь 1966 онд дэлхийд эдийн засгаараа 2-рт бичигдэх болсон. Токио хот нь 1.479 их наяд америк доллароор хэмжигдсэн 2008 оны ХАЧ-аар тэгшитгэсэн ДНБ-ын хэмжээгээрээ Нью-Йорк хотын дараа дэлхийд хоёрт эрэмбэлэгдэх том эдийн засагтай хот ба Fortune сэтгүүлээс зарладаг дэлхийн 500 том компанийн 47 нь төвлөрдөг хот болно.', ARRAY['Улаанбаатар', 'Токио', 'Улаанбаатар'], 
        'Чингис Хаан олон улсын нисэх онгоцны буудал', '2023-06-12', ARRAY['plane'], 
        ARRAY['Хөтөлбөрт заагдсан 4 одтой зочид буудал', 'Хөтөлбөрт заагдсан хоол', 'Хөтөлбөрт заагдсан Монгол-Япон хэлтэй аяллын хөтөч тайлбарлагч', 'Хөтөлбөрт тусгагдсан үзвэр, үйлчилгээний тасалбар, хураамжийн үнэ', 'Хөтөлбөрийн дагуу үйлчлэх орон нутгийн тээврийн үйлчилгээ', 'Гадаадад зорчигчийн аяллын иж бүрэн даатгал', 'Визний хураамж'], ARRAY['PCR шинжилгээний төлбөр', 'Хувийн хэрэглээний зардал', 'Аяллын үнэд багтаагүй бусад зардал', 'ОУ-ын нислэгийн илүү тээшний хураамж', 'ОУ-ын хоёр талын нислэгийн тийз'], 
        ARRAY['{"title": "УЛААНБААТАР – ТОКИО, ЯПОН", "plan": "Бидний аялал Чингис Хаан нисэх буудлаас Улаанбаатар Нарита чиглэлийн онгоцонд сууснаар эхэлнэ. Японы Нарита олон улсын нисэх буудалд газардсаны дараа мэргэжлийн хөтөч, жолооч нар тосон авч, Токио хотын зүг хөдлөнө. Токиогийн хамгийн эртний Будда сүм болох Сенсожи сүмтэй танилцана. Уг сүмийн хажууханд байрлах 17-р зуунаас эхтэй Японы эртний худалдааны гудамж Накамисэ гудмаар зугаалж, хотын бэлэг дурсгалын дэлгүүр болон хамгийн амттай хоолны бүхээгүүдээр үйлчлүүлэх боломжтой. Түүний дараа зочид буудалдаа хүргүүлнэ.", "hotel": "Зочид буудалд", "meal": "орой"}'::jsonb, '{"title": "ТОКИО ХОТ","plan": "Өглөөний цайгаа буудалдаа уугааад өдрийн аялалдаа гарна. Одайба (Токиогийн хиймэл эрэг) дахь Тоёота Мега Вэб авто машины үзэсгэлэнгээр зочилж, Эрх чөлөөний хөшөөний ард, Солонгон гүүртэй хамт гэрэл зургаа авхуулна. Томоохон худалдааны төвөөр үйлчлүүлж худалдан авалт хийх боломжтой. Оройн хоолоо идээд буудалдаа очин амарна.","hotel": "Зочид Буудал.","meal": "Өглөө, Өдөр, Оройн Хоол"}'::jsonb, '{"title": "ТОКИО ХОТ- ФҮЖИ УУЛЫН АЯЛАЛ","plan": "Өглөөний цайны дараа Япон улсын бэлгэдэл болох хамгийн өндөр уул Фүжи уулыг зорин хөдлөнө. Фүжи уулын тав дахь тавцан буюу машинаар гарч болох хамгийн өндөр цэгт гарна. Та бүхэн энд зургаа авхуулж бэлэг дурсгалын зүйл худалдан авах боломжтой. (цас болон бороо салхи ихтэй үед дээш гаргахыг хоргилсон байдаг тул тухайн үеийн цаг уурын нөхцөл байдлыг харгалзана) Түүний дараа алдарт Ошино хаккай цөөрөмтэй танилцана. Энд Япончуудын эртний амьдарлыг харуулсан хэв маяг бүхий дурсгалт газар их бий. Мөн Фүжи уулыг алсаас тольдон халуун кофи уух боломжтой. Орой нь эртний хэв маягийг агуулсан (рёкан) зочид буудалд байрлана. Зочид буудалдаа халуун рашаанд орох боломжтой.","hotel": "Зочид Буудалд","meal": "Өглөө, Өдөр, Оройн Хоол."}'::jsonb, '{"title": "ФҮЖИ УУЛ - ТОКИО ХОТ","plan": "Өглөөний цайгаа уугаад Токио хотын зүг хөдлөнө. Буцах замдаа Японы томоохонд тооцогдох Готемба аутлет худалдааны төвөөр орно. Та энд дэлхийн алдартай брэндийг худалдан авах боломжтой. Үдээс хойш Токио хотын зочид буудалдаа ирж амарна. Үдээс хойш чөлөөт өдөр тул буудлын ойролцоох дэлгүүрээр худалдан авалт хийх боломжтой.","hotel": "Зочид Буудалд","meal": "Өглөө, өдөр, оройн хоолыг аялагчид өөрсдөө"}'::jsonb, '{"title": "ТОКИО – НАРИТА – УЛААНБААТАР","plan": "Өглөөний цайгаа боолтоор эсвэл буфетээр зооглоод зочид буудлын өрөөгөө хүлээлгэн өгнө. Нарита олон улсын нисэх онгоцны буудал руу хүргүүлэн Улаанбаатар чиглэлийн онгоцондоо суун аялал өндөрлөнө.","meal": "Өглөө"}'::jsonb],
        'assets/img/card-1-tokyo.png', ARRAY['https://gaijinpot.scdn3.secure.raxcdn.com/app/uploads/sites/6/2016/01/Yamanashi-2-1024x908.jpg', 'https://gaijinpot.scdn3.secure.raxcdn.com/app/uploads/sites/6/2016/02/Mount-Fuji-Climbing-Season.jpg', 'https://gaijinpot.scdn3.secure.raxcdn.com/app/uploads/sites/6/2018/08/Mt-Tenjo-Lookout-800x500.jpg'], 'active');

INSERT INTO blogs (id, altText, title, content, author, publishDate, category, image)
VALUES (1, 'Алтан овоо', 'Алтан овооны тухай', 'Дарь-Овоо гэж нэрлэх нь ч бий. Дарьгангын галт уулсын нэг бөгөөд далайн төвшнөөс дээш 1354 метр өндөр. Дарьганга сумын төвийн дэргэд орших энэ уул нь Сүхбаатар аймгийн урд хэсгийн 6 суманд амьдардаг Дарьгангачуудын шүтэн биширдэг уул юм. XYII зууны үеэс нутгийнхан тахиж ирсэн бөгөөд 1913 оноос Богд хааны зарлигаар тахиж ирсэн. Монгол орны өргөн олныг хамарсан их тахилга хийдэг уулын нэг.Хэсэг хугацаанд тахилга зогсоод байсан энэ овооны тахилгыг 1990-ээд оны үеэс дахин сэргээж 2004 оноос эхлэн төрийн тахилгат уул болгожээ. 2004 онд оройд нь байх Алтан ганжирыг бүрэн алтадсан байна.Алтан-Овоонд зөвхөн эрчүүд л гарч сүслэн мөргөдөг. Архи дарсаа өргөж, арц хүжээ аравнайлдаг. Энэ овоо бол зөвхөн эрчүүдийн гараар боссон овоо юм. Алтан-Овоон дээр эмэгтэй хүн гардаггүй бөгөөд харин эмэгтэйчүүд овооны баруун урд орших арай намхан дэвсэг дээр гардаг, бас бэлээр нь тойрдог зам бий. Алтан-Овоо баруун хойшоо сэтэрч урссан тогоотой бөгөөд овооны баруун талд Дуут нуур, харин зүүн талд Шилийн богд уул байдаг.Алтан-Овооны сорогшин модыг Отгонтэнгэр уулнаас залсан гэдэг. Овооны гол мод буюу амь модыг сорогшин хэмээнэ. Энэ модыг авахдаа газар дэлхийн лус савдагт тахил балин идээ цайныхаа дээжийг өргөж сан тавина. Сорогшин хэмээх мод нь мөнхийн ногоон, үр жимстэй мод байх агаад манай оронд самрын модоор хийдэг ажээ. Алтан-Овоонд залсан тэрхүү сорогшинг газар хүргэлгүй залж аваачсан тэр өдрөөс хойш 300 жил өнгөрчээ.', 'Админ', '2023-05-15', 'cultural-experience', 'assets/webp/blog-1.webp');

INSERT INTO reviews (id, author, review, created_at)
VALUES (1, 'Б.Энгүүн', 'Олон хүн ардынхаа төлөө гэсэн сэтгэлтэй, зохион байгуулалт сайтай, сайхан аялуулдаг гэдгийг өөрийн биеэр мэдэрлээ. Сэтгэл ханамж 100% байлаа. Монгол аяллын хамт олонд ажлын өндөр амжилт, сайн сайхан бүхнийг хүсэн ерөөе.', '2022-08-19T23:15:30.000Z')

INSERT INTO bookings (id, lastName, firstName, phoneNumber, mail, t_type, t_id, numberOfTravelers, additionalInfo, created_at, status)
VALUES (1, 'bat', 'dorj', '99999999', 'dorj@gmail.com', 'ordinary', 1, 4, 'text', '2023-05-20', 'pending');